{******************************************************************************}
{********************   БАЗА ДАННЫХ НАСТРОЕК ГЛОБАЛЬНЫХ   *********************}
{******************************************************************************}

     FILE_BD_SET_GLOBAL        =  'Настройки глобальные.mdb';
     LSEPARATOR                =  ' \ ';

     {*************************************************************************}
     {***   БД: СПИСОК СТАТУСОВ   *********************************************}
     {*************************************************************************}
     TABLE_LSTATUS             =  'Список статусов';
          LSTATUS_PPERSON      =  T_UD_PPERSON;
          LSTATUS_LPERSON      =  T_UD_LPERSON;
          LSTATUS_DPERSON      =  T_UD_DPERSON;
          LSTATUS_UG           =  'Уголовно-процессуальный';   // Уголовно-процессуальный статус
          LSTATUS_MIP          =  'Мужчина Именительный падеж';
          LSTATUS_FIP          =  'Женщина Именительный падеж';
          LSTATUS_MRP          =  'Мужчина Родительный падеж';
          LSTATUS_FRP          =  'Женщина Родительный падеж';
          LSTATUS_MDP          =  'Мужчина Дательный падеж';
          LSTATUS_FDP          =  'Женщина Дательный падеж';
          LSTATUS_MVP          =  'Мужчина Винительный падеж';
          LSTATUS_FVP          =  'Женщина Винительный падеж';
          LSTATUS_MTP          =  'Мужчина Творительный падеж';
          LSTATUS_FTP          =  'Женщина Творительный падеж';
          LSTATUS_MPP          =  'Мужчина Предложный падеж';
          LSTATUS_FPP          =  'Женщина Предложный падеж';
          LSTATUS_MANY         =  'Множественное число';
          LSTATUS_KEYFIELD     =  LSTATUS_MIP;
          LSTATUS_SEPARATOR    =  LSEPARATOR;                  // Разделитель для комплексного статуса

     {СПИСОК СТАТУСОВ ПО ПОЛУ}
     LSTATUS_MAN : array[1..7] of String = (LSTATUS_MIP, LSTATUS_MRP, LSTATUS_MDP,
                                            LSTATUS_MVP, LSTATUS_MTP, LSTATUS_FPP,
                                            LSTATUS_MANY);
     LSTATUS_FEM : array[1..6] of String = (LSTATUS_FIP, LSTATUS_FRP, LSTATUS_FDP,
                                            LSTATUS_FVP, LSTATUS_FTP, LSTATUS_FPP);



{******************************************************************************}
{********************   БАЗЫ ДАННЫХ НАСТРОЕК ЛОКАЛЬНЫХ   **********************}
{******************************************************************************}

     FILE_BD_SET_LOCAL       = 'Настройки локальные.mdb';

     {*************************************************************************}
     {***   БД: ПЕРЕМЕННЫЕ   **************************************************}
     {*************************************************************************}
     //Аналогична с FunConst_BD_UD.T_UD_VAR    = 'Переменные';

     {*************************************************************************}
     {***   БД: СПИСКИ ПОДСТАНОВКИ   ******************************************}
     {*************************************************************************}
     T_LIST                  = 'Списки';
        LIST_CATEGORY        =  'Категория';
        LIST_VALUE           =  'Значение';
        LIST_GRAGD           =  'Гражданство';
        LIST_EDUCATION       =  'Образование';
        LIST_FAMILY          =  'Семейное положение';
        LIST_BORN_PLACE      =  'Место рождения';
        LIST_SODERG          =  'Место содержания';
        LIST_DOC_TYPE        =  'Тип документа';
        LIST_DOC_PLACE       =  'Место выдачи документа';
        LIST_WORK_PLACE      =  'Место работы';
        LIST_WORK_POST       =  'Должность';
        LIST_ADDRESS         =  'Адрес';
        LIST_INVESTIGATE     =  'Исследование';

        LIST_OBJECT_CAPTION  =  'Наименование объекта';
        LIST_OBJECT_PLACE    =  'Место объекта';
        LIST_OBJECT_AGENCY   =  'Орган объекта';
        LIST_OBJECT_PERSON   =  'Лицо объекта';

        LIST_OBJECT_PACK     =  'Упаковка объекта';
        LIST_OBJECT_SEAL     =  'Опечатывание объекта';

        LIST_CAT_OLE         =  'Категория OLE';

        LIST_REST_FIO        =  F_VAR_NAME_REST + ' - ФИО';
        LIST_REST_STATUS     =  F_VAR_NAME_REST + ' - Статусы';
        LIST_REST_PLACE      =  F_VAR_NAME_REST + ' - Место';

        T_UD_VAR_OLE          = 'Переменные OLE';
        F_VAR_OLE_CAT        = 'Категория';
        F_VAR_OLE_OLE        = F_VAR_VAL_OLE;
        F_VAR_OLE_IP         = 'Именительный падеж';
        F_VAR_OLE_RP         = 'Родительный падеж';
        F_VAR_OLE_DP         = 'Дательный падеж';
        F_VAR_OLE_VP         = 'Винительный падеж';
        F_VAR_OLE_TP         = 'Творительный падеж';
        F_VAR_OLE_PP         = 'Предложный падеж';



