{******************************************************************************}
{************************   БАЗА ДАННЫХ ЭКСПЕРТИЗ   ***************************}
{******************************************************************************}

     FILE_BD_EXP = 'Экспертизы.mdb';


     {*************************************************************************}
     {*******  ТАБЛИЦА ЭКСПЕРТИЗ  *********************************************}
     {*************************************************************************}
     T_EXP_EXP = 'Экспертизы';

        F_EXP_EXP             = 'Экспертиза';      // Виртуальное поле - формируется запросом
        F_EXP_CAPTION         = 'Заголовок';
        F_EXP_INV             = 'Исследование';
        F_EXP_HINT            = 'Примечание';


     {*************************************************************************}
     {*******  ТАБЛИЦА ВОПРОСОВ  **********************************************}
     {*************************************************************************}
     T_EXP_QST = 'Вопросы';

        F_QST_EXP             = T_EXP_EXP;
        F_QST_CATEGORY        = 'Категория вопроса';   // 0 - основная категория
        F_QST_CAPTION         = 'Заголовок';
        F_QST_PPERSON         = T_UD_PPERSON;
        F_QST_HINT            = 'Примечание';



