{******************************************************************************}
{*******************************   STRUCT   ***********************************}
{******************************************************************************}


{==============================================================================}
{=========================   STRUCT: ИНИЦИАЛИЗАЦИЯ   ==========================}
{==============================================================================}
procedure TFDOC.IniStruct;
begin
    PSTRUCT.Width          := ReadLocalInteger(INI_UD, INI_DOC_STRUCT_WIDTH, PStruct.Width);
    PStruct.OnResize       := PStructResize;

    {Загружаем субформу}
    FFSTRUCT := TFSTRUCT(LoadSubForm(PStruct, TFSTRUCT, true));
end;


{==============================================================================}
{========================   STRUCT: ДЕИНИЦИАЛИЗАЦИЯ   =========================}
{==============================================================================}
procedure TFDOC.FreeStruct;
begin
    {Выгружаем субформу}
    LoadSubForm(PStruct, nil, true);
    FFSTRUCT := nil;
end;


{==============================================================================}
{=========================    PSTRUCT: ON_RESIZE   ============================}
{==============================================================================}
procedure TFDOC.PStructResize(Sender: TObject);
begin
    If PStruct.Width < 200 then PStruct.Width := 200;
    WriteLocalInteger(INI_UD, INI_DOC_STRUCT_WIDTH, PStruct.Width);
end;


