{******************************************************************************}
{***************           ОПЕРАЦИИ С ТАБЛИЦАМИ УД           ******************}
{***************                   ОБЪЕКТЫ                   ******************}
{******************************************************************************}


{==============================================================================}
{========================  ФУНКЦИЯ ДЕКОДЕРА: УПАКОВКА  ========================}
{==============================================================================}
function TDECOD.FObjectsPack(const S: String): String;
var S1, S2: String;
begin
    {Инициализация}
    Result := '';
    S1     := PUD^.FieldByName(OBJECT_PACK).AsString;
    S2     := PUD^.FieldByName(OBJECT_SEAL).AsString;

    If S1<>'' then S1:='упакован в '+PadegAUTO('В', S1);
    If S2<>'' then begin
       S2:='опечатан '  +PadegAUTO('Т', S2);
       If S<>''  then S2:=S2+' '+S;
    end;

    If (S1<>'') and (S2<>'') then Result:=S1+', '+S2 else Result:=S1+S2;
    If Result<>'' then Result:='объект '+Result;
end;

