{******************************************************************************}
{***************************   БАЗА ДАННЫХ НОРМ   *****************************}
{******************************************************************************}

      FILE_BD_ART = 'Нормы.mdb';

     {*************************************************************************}
     {*** УК ******************************************************************}
     {*************************************************************************}
     TABLE_UK                 =  'УК';
          UK_NOMER            =  'Номер';
          UK_NORM             =  'Норма';
        //UK_MIN              =  'Лишение свободы';        Пока не используется - для определения тяжести
          UK_BEGIN            =  'Начало действия';
          UK_END              =  'Конец действия';

     TABLE_COM                =  'Комментарий';
          COM_CAPTION         =  'Заголовок';
          COM_BODY            =  'Содержание';



